config.org
Please note, all entries marked todo do not work properly in my configuration. Use at own risk and mind conflicts. 


* Small tweaks

** Re-enabling functions
Some very useful functions are being disabled by default. Even though
I can understand that ther developers are trying to make this as easy
on newcomers as they can make it, having CUA-mode disabled by default
and having these swtiched off makes very little sense. 
#+begin_src emacs-lisp :tangle yes
;; these functions are useful. activate them.
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
#+end_src



** Time saving
   Minimise typing in prompts

#+begin_src emacs-lisp :tangle yes
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Sane defaults

   Syntax highlighting when writing in org mode is a must. 

#+begin_src emacs-lisp :tangle yes
;; (setq org-src-fontify-natively t)
  (custom-set-variables
   '(org-fontify-natively t)
   )
#+end_src

Custom set variables is a powerful tool and overrides most of what you do in an init file. But, you can custom set them manually whenever you wish, and these choices will never be overridden. 

One caveat is the changed syntax, and the fact that it's less readable than `setq` for example. The good thing though, is that if in emacs for some reason something in your config file doesn't load, you know how to fix it. 

#+begin_src emacs-lisp :tangle no
  (custom-set-variables '(global-linum-mode t))
#+end_src

** Splitting windows horizontally

   Splitting windows top/bottom is not the most brilliant idea one
   could have had. 

   Most modern code guidelines enforce a hard cap of 80 columns per
   line, while the number of lines per file is virtually unlimited. 

   So, a more sane set of defaults would be:
   
#+begin_src emacs-lisp :tangle yes
(setq split-height-threshold nil)
(setq split-width-threshold 0)
#+end_src

** TODO Open csv in latex mode

   I use Anki. Org mode anki is a good thing if you're dealing with
   complicated expressions, and you want to nail the layout. I'm
   dealing with maths in bulk. So I use csv to export and import to
   and fro. 
   #+begin_src emacs-lisp :tangle no
     (add-to-list 'auto-mode-alist '("'\\.csv\\'" . LaTeX-mode))
   #+end_src


** Add todo

   Add a todo item to my main dropbox account. 

#+begin_src emacs-lisp :tangle yes
(defun todo()
(interactive)
(find-file "/Users/app/Dropbox/org-notes/todo.org")
)
#+end_src
* Packages
** Core
The =package.el= and =use-package= are provided here for reference
only, as I would peronsally suggest having them in your =elisp= config
file.  

*** Package.el
The most important package to manage packages. 

#+begin_src emacs-lisp :tangle no
(require 'package)

(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
(when (boundp 'package-pinned-packages)
  (setq package-pinned-packages
        '((org-plus-contrib . "org"))))
(package-initialize)
#+end_src


*** use-package

    Here are three extensions that you *must* use, in order for this configuration file to run. 

#+begin_src emacs-lisp :tangle yes
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package))
  (use-package diminish
    :ensure t
    )
  (use-package bind-key
    :ensure t
    )

  (use-package use-package-ensure-system-package
    :ensure t
    )
#+end_src


*** Org-contrib

We would like to have the latest and greatest, so pull in the most
up-to-date org. 



#+begin_src emacs-lisp :tangle yes
(use-package org
  :ensure org-plus-contrib)
#+end_src

#+begin_src emacs-lisp :tangle yes
(use-package org-ref
  :ensure t)
#+end_src



** Time savers
*** Yet another snippet framework

`Yasnippet` is probably the most powerful tool in emacs. Give me only yas and I can produce source incredibly quickly. 
#+begin_src emacs-lisp :tangle yes
(use-package yasnippet
  :ensure t
  :mode ("/\\.emacs\\.d/snippets/" . snippet-mode)
  :init
  (custom-set-variables
    '( yas-verbosity 3)
    '(yas-global-mode 1)
    )
  )
#+end_src

*** Company

Company, a very powerful autocompletion system. It has a few quirks, that we will need to tackle, but overall it's my second favourite time-saver. 
It essentially can:
- Complete language keywords. 
- Terms you've already typed in.
- elisp functions when writing a config file
#+begin_src emacs-lisp :tangle yes
  (use-package company
    :ensure t
    :commands company-mode
    :init
    (add-hook 'prog-mode-hook 'company-mode) 
    (add-hook 'LaTeX-mode-hook 'company-mode)
    (add-hook 'org-mode-hook 'company-mode)
    :config
   (custom-set-variables
   '(company-idle-delay .5)
   '(company-show-numbers t)
   '(company-echo-delay 1)
   '(company-minimum-prefix-length 2)
   '(company-selection-wrap-around t)
   '(company-transformers '(company-sort-by-occurrence company-sort-by-backend-importance ))
  )
    :bind ("M-<Space>" . company-complete-common)
    ) 

#+end_src

Since you sometimes do need to know what your completion does, it's useful to have this snippet. 

#+begin_src emacs-lisp :tangle yes
(use-package company-quickhelp
  :ensure t
  :defer t
  :hook global-company-mode
  ;; :init (add-hook 'global-company-mode-hook #'company-quickhelp-mode)
  )
#+end_src

#+begin_src emacs-lisp :tangle yes
(define-key global-map (kbd "C-.") 'company-files)
#+end_src

Prevents malicious-interaction between yasnippet and company. 

*** Aggressive Indent

    I like to keep my project consistent, with coding standards, and a lot of them require specific amounts of indentation in specific cases. This package enforces the right indentation style regardless of what you're working on. 

    #+begin_src emacs-lisp :tangle no
  (use-package aggressive-indent-mode
    :ensure t
    :hook emacs-lisp-mode
    :hook c++-mode
  
    )
#+end_src 


*** Smartparens

Probably the most underrted package in existence. It's a must to have when doing lisp and Clojure work. It allows for you to surround items with parentheses, delimiters on a whim. 

#+begin_src emacs-lisp :tangle yes
  (use-package smartparens
    :ensure t
    :diminish smartparens-mode
    :init
    (smartparens-global-mode)
    :hook eval-expression-minibuffer-setup
    :bind 
    ("M-<backspace>". sp-backward-kill-sexp)
    ("M-<delete>". sp-forward-kill-sexp)
    ("M-[" . sp-backward-slurp-sexp)
    ("M-]" . sp-forward-slurp-sexp)
    ("M-S-[" . sp-backward-barf-sexp)
    ("M-S-]" . sp-forward-barf-sexp)
    :config
    (require 'smartparens-config)
    ;; markdown
    (defun sp--markdown-skip-asterisk (ms mb me)
      (save-excursion
	(goto-char mb)
	(save-match-data (looking-at "^\\* "))))
    (sp-with-modes 'markdown-<mode
      (sp-local-pair "*" "*"
       :unless '(sp-point-after-word-p sp-point-at-bol-p)
       :skip-match 'sp--markdown-skip-asterisk)
      (sp-local-pair "**" "**")
      (sp-local-pair "_" "_" :unless '(sp-point-after-word-p)))
    ;; haskell
    (add-to-list 'sp-no-reindent-after-kill-modes 'haskell-mode)
    ;;; org-mode
    (defun sp--org-skip-asterisk (ms mb me)
      (or (and (= (line-beginning-position) mb)
	       (eq 32 (char-after (1+ mb))))
	  (and (= (1+ (line-beginning-position)) me)
	       (eq 32 (char-after me)))))
    (defun sp--org-inside-LaTeX (id action context)
      (org-inside-LaTeX-fragment-p))
    (sp-with-modes 'org-mode
      (sp-local-pair "*" "*"
       :unless '(sp-point-after-word-p sp--org-inside-LaTeX sp-point-at-bol-p)
       :skip-match 'sp--org-skip-asterisk)
      (sp-local-pair "/" "/" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
      (sp-local-pair "~" "~" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
      (sp-local-pair "=" "=" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
      (sp-local-pair "\\[" "\\]")))
#+end_src

*** Ranger like dired
This is a must, because dired was not designed with humans in mind.

#+begin_src emacs-lisp :tangle yes
(use-package dired-ranger
  :ensure t
  :config
  (setq dired-ranger-copy-ring-size 1)
    (define-key dired-mode-map (kbd "C-w")
        (lambda ()
            (interactive)
            (dired-ranger-copy nil) ; t adds item to dired-ranger-copy-ring
            (define-key dired-mode-map (kbd "C-y") 'dired-ranger-move)))
    (define-key dired-mode-map (kbd "M-w")
        (lambda ()
            (interactive)
            (dired-ranger-copy nil)
            (define-key dired-mode-map (kbd "C-y") 'dired-ranger-paste)))
)
#+end_src
*** Multiple cursors

It's not as powerful or as intuitive as the macros present in vim or emacs, but it still has plenty of uses, when you, for example need to rename a symbol, etc. 

#+begin_src emacs-lisp :tangle yes
(use-package multiple-cursors
  :ensure t
  :bind(
	("C-n". mc/mark-next-like-this)	      
	("C-s-p" . mc/mark-previous-like-this)	  
	("C-f". mc/mark-all-like-this)	
	("C-<mouse-1>" . mc/add-cursor-on-click)
	)
  )
#+end_src
*** Elmacro

    Speaking of macros, it's one of the best parts of emacs. But sometimes you wish that you could have carried over the macro you've recorded across sessions. Have no fear, elmacro to the rescue. 

    It essentially converts keystrokes to elisp function calls, which
makes writing and optimising a function, that as opposed to a keyboard
macro doesn't have to be defined per each session. 
*** clang-format

    This is an extremely useful tool to re-format c/c++/java code. In
    most cases the default is good-enough. 

#+begin_src emacs-lisp :tangle yes
  (use-package clang-format
    :ensure t
    )
#+end_src


** Utilities
*** Sudo-save



This saves me a lot of trouble on Linux systems. Say you wanted to edit a system config file, but you didn't launch emacs as root - you forgot. 

#+begin_src emacs-lisp :tangle yes
(defun sudo-save ()
  (interactive)
  (if (not buffer-file-name)
      (write-file (concat "/sudo:root@localhost:" (ido-read-file-name "File:")))
    (write-file (concat "/sudo:root@localhost:" buffer-file-name))
    )
  )
#+end_src

*** Tramp

It's an absolute must. Lets you use ssh to connect to remote hosts and more.

#+begin_src emacs-lisp :tangle yes
(use-package tramp
	:ensure t
)
#+end_src

*** Expand region

This package is sop

*** Magit
#+begin_src emacs-lisp :tangle yes

  (use-package magit
    :ensure t
    :bind ("C-x g" . magit-status)

    )
#+end_src
The magical git integration package that saved me on more than one
occasion the embarrasment of not 

** User interface
