config.el
;; these functions are useful. activate them.
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)

(defalias 'yes-or-no-p 'y-or-n-p)

;; (setq org-src-fontify-natively t)
  (custom-set-variables
   '(org-fontify-natively t)
   )

(custom-set-variables '(global-linum-mode t))

(setq split-height-threshold nil)
(setq split-width-threshold 0)

(defun todo()
(interactive)
(find-file "/Users/app/Dropbox/org-notes/todo.org")
)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))
(use-package diminish
  :ensure t
  )
(use-package bind-key
  :ensure t
  )

(use-package use-package-ensure-system-package
  :ensure t
  )

(use-package org
  :ensure org-plus-contrib)

(use-package org-ref
  :ensure t)

(use-package yasnippet
  :ensure t
  :mode ("/\\.emacs\\.d/snippets/" . snippet-mode)
  :init
  (custom-set-variables
    '( yas-verbosity 3)
    '(yas-global-mode 1)
    )
  )

(use-package company
  :ensure t
  :commands company-mode
  :init
  (add-hook 'prog-mode-hook 'company-mode)
  (add-hook 'LaTeX-mode-hook 'company-mode)
  (add-hook 'org-mode-hook 'company-mode)
  :config
 (custom-set-variables
 '(company-idle-delay .5)
 '(company-show-numbers t)
 '(company-echo-delay 1)
 '(company-minimum-prefix-length 2)
 '(company-selection-wrap-around t)
 '(company-transformers '(company-sort-by-occurrence company-sort-by-backend-importance ))
 )
  :bind ("M-<Space>" . company-complete-common)
  )

(use-package company-quickhelp
  :ensure t
  :defer t
  :hook global-company-mode
  )

(define-key global-map (kbd "C-.") 'company-files)

(use-package smartparens
  :ensure t
  :diminish smartparens-mode
  :init (smartparens-global-mode)
  :hook eval-expression-minibuffer-setup
  :bind 
  ("M-<backspace>". sp-backward-kill-sexp)
  ("M-<delete>". sp-forward-kill-sexp)
  ("M-[" . sp-backward-slurp-sexp)
  ("M-]" . sp-forward-slurp-sexp)
  ("M-S-[" . sp-backward-barf-sexp)
  ("M-S-]" . sp-forward-barf-sexp)
  :config
  (require 'smartparens-config)
  ;; markdown
  (defun sp--markdown-skip-asterisk (ms mb me)
    (save-excursion
      (goto-char mb)
      (save-match-data (looking-at "^\\* "))))
  (sp-with-modes 'markdown-<mode
    (sp-local-pair "*" "*"
     :unless '(sp-point-after-word-p sp-point-at-bol-p)
     :skip-match 'sp--markdown-skip-asterisk)
    (sp-local-pair "**" "**")
    (sp-local-pair "_" "_" :unless '(sp-point-after-word-p)))
  ;; haskell
  (add-to-list 'sp-no-reindent-after-kill-modes 'haskell-mode)
  ;;; org-mode
  (defun sp--org-skip-asterisk (ms mb me)
    (or (and (= (line-beginning-position) mb)
	     (eq 32 (char-after (1+ mb))))
	(and (= (1+ (line-beginning-position)) me)
	     (eq 32 (char-after me)))))
  (defun sp--org-inside-LaTeX (id action context)
    (org-inside-LaTeX-fragment-p))
  (sp-with-modes 'org-mode
    (sp-local-pair "*" "*"
     :unless '(sp-point-after-word-p sp--org-inside-LaTeX sp-point-at-bol-p)
     :skip-match 'sp--org-skip-asterisk)
    (sp-local-pair "/" "/" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
    (sp-local-pair "~" "~" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
    (sp-local-pair "=" "=" :unless '(sp-point-after-word-p sp--org-inside-LaTeX))
    (sp-local-pair "\\[" "\\]")))

(use-package dired-ranger
  :ensure t
  :config
  (setq dired-ranger-copy-ring-size 1)
    (define-key dired-mode-map (kbd "C-w")
        (lambda ()
            (interactive)
            (dired-ranger-copy t)
            (define-key dired-mode-map (kbd "C-y") 'dired-ranger-move)))
    (define-key dired-mode-map (kbd "M-w")
        (lambda ()
            (interactive)
            (dired-ranger-copy nil)
            (define-key dired-mode-map (kbd "C-y") 'dired-ranger-paste)))
)

(use-package multiple-cursors
  :ensure t
  :bind(
	("C-n". mc/mark-next-like-this)	      
	("C-s-p" . mc/mark-previous-like-this)	  
	("C-f". mc/mark-all-like-this)	
	("M-<mouse-1>" . mc/add-cursor-on-click)
	)
  )

(use-package clang-format
  :ensure t
  )

(defun sudo-save ()
  (interactive)
  (if (not buffer-file-name)
      (write-file (concat "/sudo:root@localhost:" (ido-read-file-name "File:")))
    (write-file (concat "/sudo:root@localhost:" buffer-file-name))
    )
  )

(use-package tramp
:ensure t
)

(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status)
  )

(ido-mode)

(use-package ido-completing-read+
  :ensure t
  :config (ido-ubiquitous-mode)
  )
