config.org
*** TODO Helm

    I'm somewhat new to helm, but my brief brush has made me decide
    that it's not a good package. True, it has potential, but as of
    now, it's poorly made, poorly maintained, and sadly not
    particularly well thought-through. 

    I still include the configuration I used, but would advise against
    using it. 

#+begin_src emacs-lisp :tangle no
(use-package helm
  :ensure t
  :diminish helm-mode
  :init (progn
          (require 'helm-config)
          (use-package helm-projectile
            :ensure t
            :commands helm-projectile
            :bind ("C-c p h" . helm-projectile))
          (use-package helm-ag :defer 10  :ensure t)
          (setq helm-locate-command "mdfind -interpret -name %s %s"
                helm-ff-newfile-prompt-p nil
                helm-M-x-fuzzy-match t)
          (helm-mode)
          (use-package helm-swoop
            :ensure t
            :bind ("H-w" . helm-swoop)))
	  (use-package helm-descbinds
		:ensure t
		:init (helm-descbinds-mode)
		)
backup.bak		:config (setq helm-allow-mouse t)
  :bind (("C-c h" . helm-command-prefix)
         ("C-x b" . helm-mini)
         ("C-`" . helm-resume)
         ("M-x" . helm-M-x)
         ("C-x C-f" . helm-find-files)))
#+end_src
*** IDO

    First, just start the ido major mode
#+begin_src emacs-lisp :tangle yes
(ido-mode)
#+end_src

Now, since Emacs could potentially make this the default for anything
that can have completions, let's use it with everything that has
completions. 

#+begin_src emacs-lisp :tangle yes
(use-package ido-completing-read+
  :ensure t
  :config (ido-ubiquitous-mode)
  )
#+end_src

And one of the features of Helm, that I do think is useful but not
present in ido, is fuzzy matching.Sadly it crashes ido. 
*** TODO FLX IDO

#+begin_src emacs-lisp :tangle no
   (use-package flx-ido
     :ensure t
     :config
     (flx-ido-mode 1)
     (setq ido-enable-flex-matching 1)
     (setq ido-use-faces nil)
  )
#+end_src

*** LaTeX - pretty symbols

This replaces macros in text with the corresponding ASCII symbols. If you have a huge formula, this helps immensely. 

#+begin_src emacs-lisp :tangle yes
(use-package latex-pretty-symbols
  :ensure t
  :init
  (progn 
    (add-hook 'LaTeX-mode-hook 'prettify-symbols-mode)
    (add-hook 'LaTex-mode-hook 'LaTeX-math-mode)
    (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
    (setq reftex-plug-into-AUCTeX t)
    (setq TeX-auto-save t)
    )
  )

#+end_src


We might also want to have pretty symbols everywhere, not just LaTeX
source code. I found that it made python source code even more
readablke for example. 

#+begin_src emacs-lisp :tangle yes
(global-prettify-symbols-mode 1)
(add-hook
 'python-mode-hook
 (lambda ()
   (mapc (lambda (pair) (push pair prettify-symbols-alist))
         '(;; Syntax
           ("def" .      #x2131)
           ("not" .      #x2757)
           ("in" .       #x2208)
           ("not in" .   #x2209)
           ("return" .   #x27fc)
           ("yield" .    #x27fb)
           ("for" .      #x2200)
           ;; Base Types
           ("int" .      #x2124)
           ("float" .    #x211d)
           ("str" .      #x1d54a)
           ("True" .     #x1d54b)
           ("False" .    #x1d53d)
           ;; Mypy
	   ("*"	.	 #x00d7)
           ("Dict" .     #x1d507)
           ("List" .     #x2112)
           ("Tuple" .    #x2a02)
           ("Set" .      #x2126)
	   ("sum" . 	 #x2211)
           ("Iterable" . #x1d50a)
           ("Any" .      #x2754)
	   ("lambda" .	 #x03bb)
           ("Union" .    #x22c3)
	   )
	 )
   )
 )
#+end_src

*** TODO Fira code

for ligatures. Very useful, if you ask me.

#+begin_src emacs-lisp :tangle no
;; FiraCode support 
(when (window-system)
  (set-frame-font "Fira Code"))
(let ((alist '((33 . ".\\(?:\\(?:==\\|!!\\)\\|[!=]\\)")
               (35 . ".\\(?:###\\|##\\|_(\\|[#(?[_{]\\)")
               (36 . ".\\(?:>\\)")
               (37 . ".\\(?:\\(?:%%\\)\\|%\\)")
               (38 . ".\\(?:\\(?:&&\\)\\|&\\)")
               (42 . ".\\(?:\\(?:\\*\\*/\\)\\|\\(?:\\*[*/]\\)\\|[*/>]\\)")
               (43 . ".\\(?:\\(?:\\+\\+\\)\\|[+>]\\)")
               (45 . ".\\(?:\\(?:-[>-]\\|<<\\|>>\\)\\|[<>}~-]\\)")
               (46 . ".\\(?:\\(?:\\.[.<]\\)\\|[.=-]\\)")
               (47 . ".\\(?:\\(?:\\*\\*\\|//\\|==\\)\\|[*/=>]\\)")
               (48 . ".\\(?:x[a-zA-Z]\\)")
               (58 . ".\\(?:::\\|[:=]\\)")
               (59 . ".\\(?:;;\\|;\\)")
               (60 . ".\\(?:\\(?:!--\\)\\|\\(?:~~\\|->\\|\\$>\\|\\*>\\|\\+>\\|--\\|<[<=-]\\|=[<=>]\\||>\\)\\|[*$+~/<=>|-]\\)")
               (61 . ".\\(?:\\(?:/=\\|:=\\|<<\\|=[=>]\\|>>\\)\\|[<=>~]\\)")
               (62 . ".\\(?:\\(?:=>\\|>[=>-]\\)\\|[=>-]\\)")
               (63 . ".\\(?:\\(\\?\\?\\)\\|[:=?]\\)")
               (91 . ".\\(?:]\\)")
               (92 . ".\\(?:\\(?:\\\\\\\\\\)\\|\\\\\\)")
               (94 . ".\\(?:=\\)")
               (119 . ".\\(?:ww\\)")
               (123 . ".\\(?:-\\)")
               (124 . ".\\(?:\\(?:|[=|]\\)\\|[=>|]\\)")
               (126 . ".\\(?:~>\\|~~\\|[>=@~-]\\)")
               )
             ))
  (dolist (char-regexp alist)
    (set-char-table-range composition-function-table (car char-regexp)
                          `([,(cdr char-regexp) 0 font-shape-gstring]))))

#+end_src

*** org-bullets

just a splash of eye candy. It's rare to find. 

#+begin_src emacs-lisp :tangle yes
(use-package org-bullets
  :ensure t
  ;:hook (org-mode . lambda () (org-bullets-mode 1))
  :config (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  )
#+end_src
*** Rainbow delimiters

Ever had so many parentheses that you could barely orient yourself
around? No more. Now each matching set of parentheses has the same
colour while each non-matching has different. 

#+begin_src emacs-lisp :tangle yes
(use-package rainbow-delimiters
  :ensure t 
  :commands rainbow-delimiters-mode
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'LaTex-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'org-mode-hook 'rainbow-delimiters-mode)
  )
#+end_src
*** FLy- check and spell

The two linters and spellcheckers for emacs. It goes without saying
that knowing that you have a missing semicolon is good to know before
you start a long and tedious compile. 

#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :ensure t
    :config (progn (add-hook 'after-init-hook #'global-flycheck-mode)
		   (add-hook 'python-mode-hook (lambda ()
						 (flycheck-select-checker 'python-pylint)))
		   )
    )
                 
  (use-package flyspell
    :ensure t
    :defer t
    :init
    (progn
      (setq-default ispell-program-name "aspell")
      (setq-default ispell-extra-args '("--sug-mode=fast"))
      (setq-default ispell-dictionary "english")
      (add-hook 'markdown-mode-hook '(lambda () (flyspell-mode 1)))
      (add-hook 'text-mode-hook '(lambda () (flyspell-mode 1))))
    :config
    )

#+end_src
(use-package ido-completing-read+
  :ensure t
  :config (ido-ubiquitous-mode)
  )

*** Expand Region

This extends the marked region based on logic and syntax. For example
you can highlight up to word, sentence, include delimiters and all up
to a sexp. 

#+begin_src emacs-lisp :tangle yes
(use-package expand-region
  :ensure t
  :bind ("C-v" . er/expand-region)
  :bind ("C-S-v" . /er/contract-region)
  )
#+end_src

*** TODO Notifications
This is a useful package just for kicks. See this tutorial [[https://justinsboringpage.blogspot.co.uk/2014/05/sending-notifications-from-emacs.html][here]]. 

#+begin_src bash :tangle no
  brew install terminal-notifier
#+end_src

Then add this code snippet 

#+begin_src emacs-lisp :tangle no
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; notifier 
  ;; requires 'sudo gem install terminal-notifier'
  ;; stolen from erc-notifier

  (defvar terminal-notifier-command
    (executable-find "terminal-notifier")
    "The path to terminal-notifier."
    )
  ((lambda () terminal-notifier-command))
  ;; Some of my own modifications
  (defvar window
    (if (boundp 'aquamacs-version) "org.gnu.Aquamacs" "org.gnu.Emacs") "The window to activate on clicking")
  (defvar message-title
    (if (boundp 'aquamacs-version) "Aquamacs" "Emacs") "the title of notifications")
  ;;Check if we're running Emacs or Aquamacs.
  (defvar icon
    (if (boundp 'aquamacs-version)
	"/Applications/Aquamacs.app/Contents/Resources/Aquamacs.icns" "https://www.gnu.org/software/emacs/images/emacs.png")
    )


  (defun terminal-notifier-notify (title message)
    "Show a message with `terminal-notifier-command`."
    (start-process "terminal-notifier"
		   "*terminal-notifier*"
		   terminal-notifier-command
		   "-title" title
		   "-message" message
		   "-activate" window
		   "-sound" "default"
		   "-appIcon" icon
		   )
    )



  (defun timed-notification(time message)
    (interactive
     "sNotify when (e.g: 2 minutes, 60 seconds, 3 days): \nsMessage: ")
    (run-at-time time nil
		 (lambda (msg) (terminal-notifier-notify message-title msg)) message)
    )


#+end_src

then use the interactive function timed-notification, to see a timed notificaton. 

I've taken the liberty of adding the `-appIcon` parameter, and making it set a distinction between emacs and aquamacs.  

Another solution if you can't install terminal notifier is this
function here. Sadly it can't change the notification's icon. 

*** TODO Alert

Alert is a useful package that is used by many others

#+begin_src emacs-lisp :tangle no
  (use-package alert
    :defer t
    :config
    (alert-add-rule :mode     'org-mode
		    :category "random-todo"
		    :style 'notifier
		    :continue t)
    (alert-add-rule :mode 'org-mode
		    :category "org-alert"
		    :style 'notifier
		    :continue t)
		    )

#+end_src

